app/controllers/cars_controller.rb

  def index
      user = User.find(params[:user_id])
      return render json: { error: "User not found" }, status: :not_found unless user

      recommendations = CarRecommendationService.fetch_recommendations(user.id)
      recommended_cars = recommendations.index_by { |rec| rec[:car_id] }

      cars = Car.joins(:brand)
                .select('cars.*, brands.name AS brand_name, brands.id AS brand_id')
                .then { |query| filter_by_query(query, params[:query]) }
                .then { |query| filter_by_price(query, params[:price_min], params[:price_max]) }

      cars = cars.map do |car|
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
SELECT cars.*, brands.name AS brand_name, brands.id AS brand_id FROM "cars" INNER JOIN "brands" ON "brands"."id" = "cars"."brand_id"

    def determine_label(user, car)
      brand_match = user.preferred_brands.exists?(id: car.brand_id)
---
SELECT 1 AS one FROM "brands" INNER JOIN "user_preferred_brands" ON "brands"."id" = "user_preferred_brands"."brand_id" WHERE "user_preferred_brands"."user_id" = $1 AND "brands"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]